src/DataProcessors/ПорядокДляСайта/ПорядокДляСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПорядокДляСайта</name>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ПорядокДляСайта/ObjectModule.bsl
Процедура Заполнить() Экспорт
	
	Книги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Книги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Книги КАК Книги
		|ГДЕ
		|	НЕ Книги.ПометкаУдаления
		|	И НЕ Книги.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Книги.ПорядокДляСайта";
	
	Книги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
